Revit 2027 API
VertexPositionNormal.Normal Property
 The vertex's normal vector.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Normal { get; set; }
Public Property Normal As XYZ
	Get
	Set
public:
property XYZ^ Normal {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Normal : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace